{
  "Ano": "2016",
  "Número": "49",
  "Enunciado": "O protocolo MESI (conhecido também como protocolo de Illinois) é um protocolo de\n coerência de cache e coerência de memória largamente utilizado. Quais são os quatro estados de linha\n da memória cache de acordo com o Protocolo MESI e quais seus respectivos significados?",
  "A": "Ampliada: a linha da cache foi modificada (é o dobro da memória principal) e está presente em\n    toda cache. Dedicada: a linha da cache é destinada à memória principal e não está presente em\n    nenhuma outra cache. Replicada: a linha da cache é replicada na memória principal e pode estar\n    presente em outra cache. Finita: a linha da cache contém dados válidos apenas na memória\n    principal.",
  "B": "Modificada: a linha da cache foi modificada (é diferente da memória principal) e está presente\n    apenas nessa cache. Exclusiva: a linha da cache é igual àquela na memória principal e não está\n    presente em nenhuma outra cache. Compartilhada: a linha da cache é igual àquela na memória\n    principal e pode estar presente em outra cache. Inválida: a linha da cache não contém dados\n    válidos.",
  "C": "Ampliada: a linha da cache foi ampliada (é maior que a memória principal) e está presente em toda\n    cache. Exclusiva: a linha da cache é igual àquela na memória principal e não está presente em\n    nenhuma outra cache. Replicada: a linha da cache é replicada na memória principal e pode estar\n    presente em outra cache. Finita: a linha da cache contém dados válidos apenas na principal e a\n    cache é limitada.",
  "D": "Modificada: a linha da cache foi duplicada (é diferente da memória principal) e está presente em\n    toda cache. Dedicada: a linha da cache é destinada à memória principal e não está presente em\n    nenhuma outra cache. Compartilhada: a linha da cache é diferente da memória principal e pode\n    estar presente em outra cache. Finita: a linha da cache contém dados válidos apenas na memória\n    principal.",
  "E": "Ampliada: a linha da cache foi modificada (é o dobro da memória principal) e está presente em\n    toda cache. Dedicada: a linha da cache é destinada à memória principal e não está presente em\n    nenhuma outra cache. Replicada: a linha da cache é replicada na memória principal e pode estar\n    presente em outra cache. Inválida: a linha da cache não contém dados válidos na memória\n    principal.\n Execução: Fundatec                                                                                17\n                                         EXAME POSCOMP – 2016\n",
  "Imagens": {},
  "Resposta": "B",
  "Componente": "Fundamentos de Computação",
  "Subarea": "FUNDAMENTOS DA COMPUTAçãO"
}
